app/controllers/comments_controller.rb

  def create
    @comment = @commentable.comments.build(comment_params)
    @comment.user = current_user
    @comment.post = @post
    @comment.save
---
INSERT INTO "comments" ("post_id", "content", "user_id", "created_at", "updated_at", "commentable_type", "commentable_id") VALUES (?, ?, ?, ?, ?, ?, ?)  [["post_id", 2], ["content", "asdasd"], ["user_id", "2"], ["created_at", 2017-03-15 22:54:04 UTC], ["updated_at", 2017-03-15 22:54:04 UTC], ["commentable_type", "Post"], ["commentable_id", 2]]

  def set_context
    if params[:comment_id]
      @commentable = Comment.find(params[:comment_id])
      @post = Post.find(@commentable.post_id)
---
SELECT  "comments".* FROM "comments" WHERE "comments"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]